package com.cn.sleep;

public class MyData {
	// 假期
		public static String[] holiday1 = { 
				"2020-01-01", // 元旦
				"2020-01-24", // 春节
				"2020-01-25", // 春节
				"2020-01-26", // 春节
				"2020-01-27", // 春节
				"2020-01-28", // 春节
				"2020-01-29", // 春节
				"2020-01-30", // 春节
				"2020-01-31", // 春节
				"2020-02-01", // 春节
				"2020-02-02", // 春节
				"2020-04-04", // 清明节
				"2020-04-05", // 清明节
				"2020-04-06", // 清明节
				"2020-05-01", // 劳动节
				"2020-05-02", // 劳动节
				"2020-05-03", // 劳动节
				"2020-05-04", // 劳动节
				"2020-05-05", // 劳动节
				"2020-06-25", // 端午节
				"2020-06-26", // 端午节
				"2020-06-27", // 端午节
				"2020-10-01", // 中秋节
				"2020-10-02", // 国庆节
				"2020-10-03", // 国庆节
				"2020-10-04", // 国庆节
				"2020-10-05", // 国庆节
				"2020-10-06", // 国庆节
				"2020-10-07", // 国庆节
				"2020-10-08", // 国庆节
		};

		// 调休
		public static String[] holiday2 = { 
				"2020-01-19", // 春节_调休
				"2020-04-26", // 清明_节调休
				"2018-05-09", // 劳动_节调休
				"2018-09-29", // 国庆节_调休
				"2018-09-30", // 国庆节_调休
				"2018-12-29"  // 元旦_调休
		};

		// 作息时间1
		public static String[] workTime1 = { 
				"08:30", // 上午上班时间
				"12:00", // 上午下班时间
				"13:00", // 下午上班时间
				"17:30"  // 下午下班时间
		};

		// 作息时间2
		public static String[] workTime2 = { 
				"09:00", // 上午上班时间
				"12:00", // 上午下班时间
				"13:00", // 下午上班时间
				"18:00"  // 下午下班时间
		};
}
